admin/app/Models/Barang_model.php

	public function data_barang(){
		return $this->findAll();
---
SELECT *
FROM `barang`