admin/app/Models/Pelanggan_model.php

	public function data_pelanggan(){
		return $this->findAll();
---
SELECT *
FROM `pelanggan`