admin/app/Models/Pembayaran_model.php

	public function data_pembayaran(){
		$builder = $this->db->table('pembayaran');
		$builder->select('*');
		$builder->join('pesan', 'pembayaran.no_order = pesan.no_order', 'left');
		$query = $builder->get();
---
SELECT *
FROM `pembayaran`
LEFT JOIN `pesan` ON `pembayaran`.`no_order` = `pesan`.`no_order`