admin/app/Models/Pengiriman_model.php

	public function data_pengiriman(){
		$builder = $this->db->table('pengiriman');
		$builder->select('*');
		$builder->join('pembayaran', 'pengiriman.kd_pembayaran = pembayaran.kd_pembayaran', 'left');
		$query = $builder->get();
---
SELECT *
FROM `pengiriman`
LEFT JOIN `pembayaran` ON `pengiriman`.`kd_pembayaran` = `pembayaran`.`kd_pembayaran`