admin/app/Models/Retur_model.php

SELECT *
FROM `retur`
---
  public function data_retur(){
    return $this->findAll();