app/Models/Barang_model.php

  public function get_data_barang(){
    $builder = $this->db->table('barang');
    $builder->select('*');
    $query = $builder->get();
---
SELECT *
FROM `barang`

  public function info_barang($id=''){
    return $this->getWhere(['kd_barang' => $id]);
---
SELECT *
FROM `barang`
WHERE `kd_barang` = 'B-0003'