app/Models/Keranjang_model.php

  public function get_data_keranjang($kd_pelanggan, $kd_barang){
    return $this->getWhere(['kd_pelanggan' => $kd_pelanggan, 'kd_barang' => $kd_barang]);
---
SELECT *
FROM `keranjang`
WHERE `kd_pelanggan` = 'LS001'
AND `kd_barang` = 'B-0003'

  public function get_keranjang($kd_pelanggan=''){
    $builder = $this->db->table('keranjang');
    $builder->select('*');
    $builder->join('barang','barang.kd_barang = keranjang.kd_barang', 'left');
    $builder->where('kd_pelanggan', $kd_pelanggan);
    $query = $builder->get();
---
SELECT *
FROM `keranjang`
LEFT JOIN `barang` ON `barang`.`kd_barang` = `keranjang`.`kd_barang`
WHERE `kd_pelanggan` = 'LS001'