app/Models/Pesan_model.php

	public function data_pesan(){
		$builder = $this->db->table('pesan');
		$builder->select('*');
		$builder->join('pelanggan', 'pesan.kd_pelanggan = pelanggan.kd_pelanggan', 'left');
		$query = $builder->get();
---
SELECT *
FROM `pesan`
LEFT JOIN `pelanggan` ON `pesan`.`kd_pelanggan` = `pelanggan`.`kd_pelanggan`